输入和输出通常有以下几种类型：
- 读取文本文件及硬盘上其它更高效的格式文件
- 从数据库载入数据
- 与网络资源进行交互（比如Web API）

# 6.1 文本格式数据的读写

In [11]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame 
#　让我们从一个小型的逗号分隔文本文件开始
!type examples\ex1.csv
# 由于这个文件是逗号分隔的，我们使用read_csv将它读入一个DataFrame:
df = pd.read_csv('examples\ex1.csv')
df

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
pd.read_table('examples\ex1.csv', sep = ',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
!type examples\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [18]:
pd.read_csv('examples\ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [20]:
pd.read_csv('examples\ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [21]:
pd.read_csv('examples\ex2.csv', names=['a', 'b', 'c', 'd', 'message'], index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [33]:
# 当你想要从多个列中形成一个分层索引，需要传入一个包含列序号或列名的列表
!type examples\csv_mindex.csv

key1,key2, value1 ,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [35]:
parsed = pd.read_csv('examples\csv_mindex.csv', index_col=['key1', 'key2'])
parsed

            value1   value2
key1 key2
one  a            1       2
     b            3       4
     c            5       6
     d            7       8
two  a            9      10
     b           11      12
     c           13      14
     d           15      16

In [38]:
list(open('examples\ex3.txt'))

['         A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399 \n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491']

In [39]:
result = pd.read_table('examples\ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [40]:
!type examples\ex4.csv

# 嘿！,,,,
a,b,c,d,message
# 只是为了让你觉得更难,,,,
# 谁用计算机读取CSV文件？,,,,
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [41]:
pd.read_csv('examples/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [43]:
!type examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [46]:
result = pd.read_csv('examples\ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [47]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [49]:
# na_values 选项可以传入一个列表或一组字符串来处理缺失值
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [50]:
# 在字典中，每咧可以指定不同的缺失值标识
sentinels = {'message':['foo', 'NA'], 'something':['two']}
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

## 6.1.1 分块读入文本文件

In [51]:
pd.options.display.max_rows = 10
result = pd.read_csv('examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [52]:
pd.read_csv('examples/ex6.csv', nrows = 5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [57]:
chunker = pd.read_csv('examples\ex6.csv', chunksize = 1000)
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)
tot

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
     ...
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
Length: 36, dtype: float64

## 6.1.2 将数据写入文本格式

In [58]:
data = pd.read_csv('examples\ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [59]:
data.to_csv('examples\out.csv')

In [60]:
!type examples\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [61]:
import sys
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [63]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [64]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [75]:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv('examples/tseries.csv')

In [72]:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv('examples/tseries.csv')

In [73]:
!type examples\tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

## 6.1.3 使用分隔格式

In [76]:
!type examples\ex7.csv

a,b,c
1,2,3
1,2,3

In [77]:
import csv
f = open('examples\ex7.csv')
reader = csv.reader(f)
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

## 6.1.4 JSON数据

# 6.2 二进制格式

In [78]:
frame = pd.read_csv('examples/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [79]:
frame.to_pickle('examples/frame_pickle')

In [80]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

## 6.2.1 使用HDF5格式

In [83]:
frame = pd.DataFrame({'a':np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [84]:
store['obj1']

           a
0   0.568423
1   0.543341
2  -0.325426
3   0.001413
4   0.387238
..       ...
95 -0.047467
96  0.769372
97  0.184531
98  0.381301
99 -0.161787

[100 rows x 1 columns]

In [86]:
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -0.015551
11 -1.120885
12 -0.281192
13 -1.366015
14  1.108309
15  0.555945

In [87]:
store.close()

## 6.2.2 读取Microsoft Excel文件

In [92]:
xlsx = pd.ExcelFile('examples\ex1.xlsx')
pd.read_excel(xlsx, 'Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [93]:
pd.read_excel('examples\ex1.xlsx', 'Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

# 6.3 与Web API交互

In [94]:
# 使用 requests 包交互
# 使用附加库 requests 发送一个 HTTP GET 请求：

In [96]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [98]:
data = resp.json()
data[0]['title']

'NoneType error during json_normalize due to schema change'

In [101]:
issues = pd.DataFrame(data, columns=['number', 'titile', 'labels', 'state'])
issues

    number  titile                                             labels state
0    30148     NaN                                                 []  open
1    30147     NaN                                                 []  open
2    30146     NaN                                                 []  open
3    30145     NaN                                                 []  open
4    30144     NaN  [{'id': 47229190, 'node_id': 'MDU6TGFiZWw0NzIy...  open
..     ...     ...                                                ...   ...
25   30091     NaN  [{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...  open
26   30087     NaN                                                 []  open
27   30086     NaN                                                 []  open
28   30083     NaN  [{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...  open
29   30081     NaN  [{'id': 685114413, 'node_id': 'MDU6TGFiZWw2ODU...  open

[30 rows x 4 columns]

# 6.4 与数据库交互